// 도시 별 경도 위도
type coordinate = Record<string, { lat: number; lon: number }>;

export const cityCoordinates: coordinate = {
  서울: { lat: 37.5665, lon: 126.978 },
  부산: { lat: 35.1796, lon: 129.0756 },
  대구: { lat: 35.8722, lon: 128.6025 },
  인천: { lat: 37.4563, lon: 126.7052 },
  광주: { lat: 35.1595, lon: 126.8526 },
  경주: { lat: 35.8562, lon: 129.2247 },
  대전: { lat: 36.3504, lon: 127.3845 },
  울산: { lat: 35.5384, lon: 129.3114 },
  경기: { lat: 37.4138, lon: 127.5183 }, // 수원 기준
  강원: { lat: 37.8228, lon: 128.1555 }, // 춘천 기준
  충북: { lat: 36.6358, lon: 127.4917 }, // 청주 기준
  경남: { lat: 35.4606, lon: 128.2132 }, // 창원 기준
  전주: { lat: 35.8242, lon: 127.1479 },
  경북: { lat: 36.5683, lon: 128.7294 }, // 안동 기준
  제주: { lat: 33.4996, lon: 126.5312 },
  전북: { lat: 35.7175, lon: 127.153 }, // 전주 기준
  전남: { lat: 34.8161, lon: 126.463 }, // 무안 기준
  충남: { lat: 36.5184, lon: 126.8 }, // 홍성 기준
  세종: { lat: 36.48, lon: 127.289 },
};
