// 도시 별 경도 위도
type coordinate = Record<string, { lat: number; lon: number }>;

export const cityCoordinates: coordinate = {
  서울: { lat: 37.5729, lon: 126.9794 },
  부산: { lat: 35.1068, lon: 129.0312 },
  대구: { lat: 35.8683, lon: 128.5988 },
  인천: { lat: 37.4643, lon: 126.5904 },
  광주: { lat: 35.173, lon: 126.889 },
  경주: { lat: 35.8562, lon: 129.2247 },
  대전: { lat: 36.3515, lon: 127.4239 },
  울산: { lat: 35.5664, lon: 129.319 },
  경기: { lat: 37.2636, lon: 127.0286 }, // 수원 기준
  강원: { lat: 37.8816, lon: 127.7291 }, // 춘천 기준
  충북: { lat: 36.6419, lon: 127.4898 }, // 청주 기준
  충남: { lat: 36.8145, lon: 127.1469 }, // 천안 기준
  경북: { lat: 36.0194, lon: 129.3434 }, // 포항 기준
  경남: { lat: 35.2372, lon: 128.6811 }, // 창원 기준
  전주: { lat: 35.8242, lon: 127.1489 },
  제주: { lat: 33.4996, lon: 126.5312 },
  전북: { lat: 35.8194, lon: 127.1063 }, // 전주 기준
  전남: { lat: 34.812, lon: 126.3917 }, // 목포 기준
  세종: { lat: 36.4801, lon: 127.2889 },
};
